Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИспользованиеХарактеристик</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыИспользованияХарактеристикНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ТТМ_ОтправкаКодовТТМвТрапезу/Ext/Module.bsl
Процедура ТТМ_Отправка_Изменений_Номенклатуры() Экспорт	
	
	ИзмененияНоменклатуры = ПолучитьДанныеДляОтправки();
	Если ИзмененияНоменклатуры.Количество() = 0 Тогда 
		//Сообщить("Отсутствуют данные для отправки!", СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
		
	СтрокаПодключения = СтрокаСоединенияИнформационнойБазы(); 
	Если СтрНайти(СтрокаПодключения,"ttm-hz-01",НаправлениеПоиска.СНачала,,) = 0
		и СтрНайти(СтрокаПодключения,"172.17.16.28",НаправлениеПоиска.СНачала,,) = 0 Тогда 
		//Сообщить("Имя сервера не соответствует! Соединение не установлено!");
		Возврат;                                 
	КонецЕсли;                                   
	//Сообщить("Установка соединения!");
	
	Сервер = "naladil-exchange.trapeza.ru"; 	//"37.16.83.235";
	HTTPСоединение = Новый HTTPСоединение(Сервер, 8089, , , , , , );
	HTTPЗапрос = Новый HTTPЗапрос("/UT_DR_WORK/hs/TTMExchange/changesuppliercodes/");
	
	HTTPЗапрос.Заголовки.Вставить("Content-Type","application/json");
	HTTPЗапрос.Заголовки.Вставить("X-Auth-Token", "dI8nNCpnbEfoLGD4hIXTDtDHETELEtBeqsiwZOWM37TXoAcn8lfKeFAcOvX4XaTO");
	
	// Формирование тела запроса в формате JSON
	ДанныеДляОтправки = Новый Массив;
	Для Каждого Стр из ИзмененияНоменклатуры Цикл 
		
		ДанныеТТМ = Новый Структура("codedr, codettm, supplyer");
		ЗаполнитьЗначенияСвойств(ДанныеТТМ,Стр);
		ДанныеДляОтправки.Добавить(ДанныеТТМ); 

	КонецЦикла;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ДанныеДляОтправки);
	ТелоЗапросаJSON = ЗаписьJSON.Закрыть();

	// Установка тела запроса в HTTPЗапрос
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапросаJSON, КодировкаТекста.UTF8);
	
	Попытка

		HTTPОтвет = HTTPСоединение.ВызватьHTTPМетод("POST", HTTPЗапрос);

		КодСостояния = HTTPОтвет.КодСостояния;
		ЗаголовкиОтвета = HTTPОтвет.Заголовки;    
		ТелоОтветаСтрокой = HTTPОтвет.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);

		Если КодСостояния = 200 Тогда 
			Если ЗначениеЗаполнено(ТелоОтветаСтрокой) Тогда 
				//Сообщить(" Успешный POST-запрос. Код состояния: " + КодСостояния + ". Ответ сервера: " + ТелоОтветаСтрокой, СтатусСообщения.Важное);
			Иначе 
				//Сообщить("Успешный POST-запрос. Код состояния: " + КодСостояния);
			КонецЕсли;;
		ИначеЕсли КодСостояния = 400 Тогда     
			//Сообщить("Ошибка соединения, не передан токен " + КодСостояния + ". Описание ошибки: " + ТелоОтветаСтрокой, СтатусСообщения.Важное);
		ИначеЕсли КодСостояния = 401 Тогда 
			//Сообщить("Ошибка соединения, неверный токен " + КодСостояния + ". Описание ошибки: " + ТелоОтветаСтрокой, СтатусСообщения.Важное);
		ИначеЕсли КодСостояния = 404 Тогда 
			//Сообщить("Ошибка разбора JSON. Код состояния: " + КодСостояния + ". Описание ошибки: " + ТелоОтветаСтрокой, СтатусСообщения.Важное);
		Иначе 
			//Сообщить("Ошибка соединения. Код состояния: " + КодСостояния + " " + ОписаниеОшибки());
		КонецЕсли; 
		
	Исключение
		
		//Сообщить("Ошибка отправки POST-запроса: " + ОписаниеОшибки(), СтатусСообщения.Важное);
		
	КонецПопытки;

КонецПроцедуры   

Функция ПолучитьДанныеДляОтправки()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НоменклатураДополнительныеРеквизиты.Ссылка КАК Номенклатура,
	               |	ЕСТЬNULL(НоменклатураДополнительныеРеквизиты.Значение, """") КАК КодДР,
	               |	ВЫБОР
	               |		КОГДА НоменклатураДополнительныеРеквизиты.Ссылка.ВидНоменклатуры.Наименование = ""Продукция Роболабс""
	               |			ТОГДА ""2""
	               |		ИНАЧЕ ""1""
	               |	КОНЕЦ КАК Поставщик,
	               |	НоменклатураДополнительныеРеквизиты.Ссылка.КодДляПоиска КАК КодТТМ
	               |ПОМЕСТИТЬ КодыДР
	               |ИЗ
	               |	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	               |ГДЕ
	               |	НоменклатураДополнительныеРеквизиты.Свойство = &СвойствоАртикулДР
	               |	И НЕ НоменклатураДополнительныеРеквизиты.Ссылка.ПометкаУдаления
	               |	И НЕ НоменклатураДополнительныеРеквизиты.Ссылка.ЭтоГруппа
	               |	И НоменклатураДополнительныеРеквизиты.Ссылка.ВидНоменклатуры В ИЕРАРХИИ(&ГруппаПродукции)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВерсииОбъектов.Объект КАК Номенклатура,
	               |	МАКСИМУМ(ВерсииОбъектов.НомерВерсии) КАК НомерВерсии,
	               |	КодыДР.КодДР КАК codedr,
	               |	КодыДР.Поставщик КАК supplyer,
	               |	КодыДР.КодТТМ КАК codettm
	               |ИЗ
	               |	КодыДР КАК КодыДР
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВерсииОбъектов КАК ВерсииОбъектов
	               |		ПО ((ВЫРАЗИТЬ(ВерсииОбъектов.Объект КАК Справочник.Номенклатура)) = ЕСТЬNULL(КодыДР.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)))
	               |ГДЕ
	               |	ВерсииОбъектов.Объект ССЫЛКА Справочник.Номенклатура
	               |	И ВерсииОбъектов.ДатаВерсии >= &ДатаВерсии
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВерсииОбъектов.Объект,
	               |	КодыДР.КодДР,
	               |	КодыДР.Поставщик,
	               |	КодыДР.КодТТМ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	КодыДР.КодДР";
	
	ГруппаНоваяИерархия = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Новая иерархия", Истина);
	ГруппаПродукция = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Продукция", Истина, ГруппаНоваяИерархия);
	ГруппаПродукцияРобо = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Продукция Робо", Истина, ГруппаПродукция);
	ГруппаПродукцияТТМ = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Продукция ТТМ", Истина, ГруппаПродукция);
	
	Продукция = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Продукция (б/х б/с)", Истина, ГруппаПродукцияТТМ);
	НейтральноеОборудование = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Нейтральное оборудование новое", Истина, ГруппаПродукцияТТМ);
	ПродукцииРоболабс = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Продукция Роболабс", Истина, ГруппаПродукцияРобо);
	//ЗИП = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("ЗИП", Истина, ГруппаПродукцияТТМ);   
	//ЗИП нельзя так синхронизировать, так как у нас нет КодовДР для ЗИП и не понятно как их загрузить, 
	//!!!нужно вручную выполнить сопоставление!!!
	
	ВидыДляОтправки = Новый Массив;
	ВидыДляОтправки.Добавить(Продукция);
	ВидыДляОтправки.Добавить(НейтральноеОборудование);
	//ВидыДляОтправки.Добавить(ЗИП);
	ВидыДляОтправки.Добавить(ПродукцииРоболабс);
	
	Запрос.УстановитьПараметр("ГруппаПродукции", ВидыДляОтправки); 
	Запрос.УстановитьПараметр("ДатаВерсии",НачалоДня(ТекущаяДата())-24*24*60*60);
	//Запрос.УстановитьПараметр("ДатаВерсии",НачалоДня(ТекущаяДатаСеанса())-24*24*60*60); //Дата(2025,12,1)); 
	Запрос.УстановитьПараметр("СвойствоАртикулДР",ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя","АртикулДР_547609cb63294018b4f565c6953c99e0")); 

	Возврат Запрос.Выполнить().Выгрузить();
	
	//ТабИзменения = ПолучитьДанныеИзмененныхОбъектов();
	//МассивНоменклатуры  = ТабИзменения.ВыгрузитьКолонку("Номенклатура");
	//	
	//Для Каждого Стр из ТабИзменения Цикл 
	//	
	//	//ТабДопРеквизиты = ВерсионированиеОбъектов.МетаданныеТабличнойЧасти(Стр.Номенклатура.Метаданные(),"ДополнительныеРеквизиты");
	//	
	//	//ВерсионированиеОбъектов.НомерПоследнейВерсии(Стр.СсылкаНаНоменклатуру,Истина);
	//	
	//	Двоичныеданные = ВерсионированиеОбъектов.СведенияОВерсииОбъекта(Стр.Номенклатура.Ссылка,Стр.НомерВерсии).Версияобъекта;
	//	Результат = ВерсионированиеОбъектов.РазборПредставленияОбъектаXML(ДвоичныеДанные, Стр.Номенклатура.Ссылка);
	//	ОтборСтрок = Новый Структура("НаименованиеРеквизита", "Артикул ДР (н/о) (СП) (Стол Standart //Т-С/S)");
	//	МассивНайденныхСтрок = Результат.Реквизиты.НайтиСтроки(ОтборСтрок);
	//	ЗначениеКодДР = МассивНайденныхСтрок[0].ЗначениеРеквизита;
	//	
	//	Стр.КодДРВерсии = ЗначениеКодДР;
	//	
	//	//ДанныеВерсии = XMLЗначение(Тип(Справочники.Номенклатура),Стр.ВерсияBase64);
	//	
	//КонецЦикла;
	
КонецФункции  

/////////////////////////////////////////////////////////////////////////

Процедура ТТМ_Отправка_Изменений_Номенклатуры_старая()
	// Параметры соединения 
	//Сервер = "http://naladil-exchange.trapeza.ru"; // Адрес сервера
	Сервер = "naladil-exchange.trapeza.ru"; 	//"37.16.83.235";
	//Порт = 8089; // Порт (80 для HTTP, 443 для HTTPS)
	//ЗащищенноеСоединение = Ложь; // Истина для HTTPS, Ложь для HTTP

	//Пользователь = ""; //необязательно
	//Пароль		 = ""; //необязательно
	
	// Создание объекта HTTPСоединение
	HTTPСоединение = Новый HTTPСоединение(Сервер, , , , , , , ); //ЗащищенноеСоединение);
	
	Заголовки = Новый Соответствие;
	//Заголовки.Вставить("Method", "POST");
	Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	Заголовки.Вставить("X-Auth-Token", "dI8nNCpnbEfoLGD4hIXTDtDHETELEtBeqsiwZOWM37TXoAcn8lfKeFAcOvX4XaTO");
	// Создание объекта HTTPЗапрос
	//HTTPЗапрос = Новый HTTPЗапрос("/UT_DR_WORK/hs/TTMExchange/changesuppliercodes/",Заголовки); // URI ресурса (путь на сервере)
	HTTPЗапрос = Новый HTTPЗапрос("/UT_DR_WORK/hs/TTMExchange/changesuppliercodes/");
	
	HTTPЗапрос.Заголовки.Вставить("Content-Type","application/json");
	HTTPЗапрос.Заголовки.Вставить("X-Auth-Token", "dI8nNCpnbEfoLGD4hIXTDtDHETELEtBeqsiwZOWM37TXoAcn8lfKeFAcOvX4XaTO");
	//http://naladil-exchange.trapeza.ru:8089/UT_DR_WORK/hs/TTMExchange/changesuppliercodes/
	
	////HTTPЗапрос.Заголовки.Вставить("Fiddler", "ТТМ");
	//HTTPЗапрос.Заголовки.Вставить("Method", "POST"); // Установка метода запроса (обязательно для POST)
	//HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8"); // Установка заголовка Content-Type (указываем формат данных в теле запроса // JSON формат //)
	//HTTPЗапрос.Заголовки.Вставить("X-Auth-Token", "dI8nNCpnbEfoLGD4hIXTDtDHETELEtBeqsiwZOWM37TXoAcn8lfKeFAcOvX4XaTO");

	ИзмененияНоменклатуры = ПолучитьДанныеДляОтправки();
	
	// Формирование тела запроса в формате JSON
	ДанныеДляОтправки = Новый Массив;
	Для Каждого Стр из ИзмененияНоменклатуры Цикл 
		
		ДанныеТТМ = Новый Структура("codedr, codettm, supplyer");
		ЗаполнитьЗначенияСвойств(ДанныеТТМ,Стр);
		ДанныеДляОтправки.Добавить(ДанныеТТМ); 

	КонецЦикла;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ДанныеДляОтправки);
	ТелоЗапросаJSON = ЗаписьJSON.Закрыть();

	// Установка тела запроса в HTTPЗапрос
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапросаJSON, КодировкаТекста.UTF8);
	
	Попытка
		//Отправка запроса и обработка результата
		HTTPОтвет = HTTPСоединение.ВызватьHTTPМетод("POST", HTTPЗапрос);

		КодСостояния = HTTPОтвет.КодСостояния;
		ЗаголовкиОтвета = HTTPОтвет.Заголовки;
		ТелоОтветаСтрокой = HTTPОтвет.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);

		Если КодСостояния = 200 Тогда 
			ТелоОтветаJSON = HTTPОтвет.ПолучитьТелоКакJSON();
			Если ТелоОтветаJSON <> Неопределено Тогда
				// Обработка JSON-ответа
				// ...
				Сообщить("Успешный POST-запрос. Код состояния: " + КодСостояния + ". Ответ сервера: " + ТелоОтветаСтрокой, СтатусСообщения.Важное);    //ТелоОтветаJSON.Строкой()
			Иначе
				// Тело ответа не удалось распарсить как JSON (или тело ответа пустое)
				Сообщить("Успешный POST-запрос. Код состояния: " + КодСостояния + ". Тело ответа не в формате JSON.",СтатусСообщения.Важное);
			КонецЕсли;
		ИначеЕсли КодСостояния = 400 Тогда     
			Сообщить("Ошибка соединения, не передан токен " + КодСостояния + ". Описание ошибки: " + ТелоОтветаСтрокой, СтатусСообщения.Важное);
		ИначеЕсли КодСостояния = 401 Тогда 
			Сообщить("Ошибка соединения, неверный токен " + КодСостояния + ". Описание ошибки: " + ТелоОтветаСтрокой, СтатусСообщения.Важное);
		Иначе //кодСостояния = 404
			Сообщить("Ошибка разбора JSON. Код состояния: " + КодСостояния + ". Описание ошибки: " + ТелоОтветаСтрокой, СтатусСообщения.Важное);
		КонецЕсли;  
		
	Исключение
		// Обработка ошибок отправки запроса
		Сообщить("Ошибка отправки POST-запроса: " + ОписаниеОшибки(), СтатусСообщения.Важное);
	КонецПопытки;

КонецПроцедуры   

/////////////////////////////////////////////////////////////////////////
